# Springboard SQL Project

In [1]:
import configparser

from sqlalchemy import create_engine
import pandas as pd

## 1. Modify sql File To enable Local PostgreSQL Usage

1. SQL File
    1. Search & replace to remove backticks
    2. Remove MySQL specific statements - ENGINE, SET_TIME_MODE
    3. Search & replace Datatypes to Postgers equivalents INT, NUMERIC
2. Manually create Dtabase `country_club`
3. Run sql file to populate tables
4. Inspect sample from each table to check data same as file, and datatypes are equivalent
5. Create .ini file with database credentials

## 2. Local Database Connection

In [2]:
config = configparser.ConfigParser()
config.read('config.ini')

conn_string = f"postgresql+psycopg2://" \
                f"{config['DB']['user']}:" \
                f"{config['DB']['password']}@" \
                f"{config['DB']['host']}/" \
                f"{config['DB']['database']}"
                    
engine = create_engine(conn_string)
engine

Engine(postgresql+psycopg2://postgres:***@127.0.0.1/country_club)

## 3. Review Table Structures

In [3]:
sql_query = """SELECT *
                    FROM facilities
            """
df = pd.read_sql_query(sql_query,con=engine)
df.head(10)

,facid,name,membercost,guestcost,initialoutlay,monthlymaintenance
0,0,Tennis Court 1,5.0,25.0,10000,200
1,1,Tennis Court 2,5.0,25.0,8000,200
2,2,Badminton Court,0.0,15.5,4000,50
3,3,Table Tennis,0.0,5.0,320,10
4,4,Massage Room 1,9.9,80.0,4000,3000
5,5,Massage Room 2,9.9,80.0,4000,3000
6,6,Squash Court,3.5,17.5,5000,80
7,7,Snooker Table,0.0,5.0,450,15
8,8,Pool Table,0.0,5.0,400,15

In [4]:
sql_query = """SELECT *
                    FROM bookings
            """
df = pd.read_sql_query(sql_query,con=engine)
df.head()

   bookid  facid  memid            starttime  slots
0       0      3      1  2012-07-03 11:00:00      2
1       1      4      1  2012-07-03 08:00:00      2
2       2      6      0  2012-07-03 18:00:00      2
3       3      7      1  2012-07-03 19:00:00      2
4       4      8      1  2012-07-03 10:00:00      1

In [5]:
sql_query = """SELECT *
                    FROM members
            """
df = pd.read_sql_query(sql_query,con=engine)
df.head()

,memid,surname,firstname,address,zipcode,telephone,recommendedby,joindate
0,0,GUEST,GUEST,GUEST,0,(000) 000-0000,,2012-07-01 00:00:00
1,1,Smith,Darren,"8 Bloomsbury Close, Boston",4321,555-555-5555,,2012-07-02 12:02:05
2,2,Smith,Tracy,"8 Bloomsbury Close, New York",4321,555-555-5555,,2012-07-02 12:08:23
3,3,Rownam,Tim,"23 Highway Way, Boston",23423,(844) 693-0723,,2012-07-03 09:32:15
4,4,Joplette,Janice,"20 Crossing Road, New York",234,(833) 942-4710,1,2012-07-03 10:25:05

## 4. Questions

/* Q1: Some of the facilities charge a fee to members, but some do not.
Please list the names of the facilities that do. */

In [6]:
sql_query = """SELECT name AS "Facilities with Member Fees"
                    FROM facilities
                WHERE
                    membercost > 0.0"""
df = pd.read_sql_query(sql_query,con=engine)
df.head(20)

  Facilities with Member Fees
0              Tennis Court 1
1              Tennis Court 2
2              Massage Room 1
3              Massage Room 2
4                Squash Court

/* Q2: How many facilities do not charge a fee to members? */

In [7]:
sql_query = """SELECT COUNT(*) AS "Number of Facilities with No Member Fees"
    FROM facilities
WHERE
    membercost = 0.0"""
df = pd.read_sql_query(sql_query,con=engine)
df.head()

   Number of Facilities with No Member Fees
0                                         4

/* Q3: How can you produce a list of facilities that charge a fee to members,
where the fee is less than 20% of the facility's monthly maintenance cost?
Return the facid, facility name, member cost, and monthly maintenance of the
facilities in question. */

In [8]:
sql_query = """SELECT
                facid AS "facid",
                name AS "Facility Name",
                membercost AS "Member Cost",
                monthlymaintenance AS "Monthly Maintenance"
            FROM facilities
                WHERE
                membercost > 0 AND
                membercost < (0.2 * monthlymaintenance)"""

df = pd.read_sql_query(sql_query,con=engine)
df.head(20)

   facid   Facility Name  Member Cost  Monthly Maintenance
0      0  Tennis Court 1          5.0                  200
1      1  Tennis Court 2          5.0                  200
2      4  Massage Room 1          9.9                 3000
3      5  Massage Room 2          9.9                 3000
4      6    Squash Court          3.5                   80

/* Q4: How can you retrieve the details of facilities with ID 1 and 5?
Write the query without using the OR operator. */

In [9]:
sql_query = """SELECT *
                FROM facilities
                WHERE
                facid IN (1,5)"""
df = pd.read_sql_query(sql_query,con=engine)
df.head()

,facid,name,membercost,guestcost,initialoutlay,monthlymaintenance
0,1,Tennis Court 2,5.0,25.0,8000,200
1,5,Massage Room 2,9.9,80.0,4000,3000

/* Q5: How can you produce a list of facilities, with each labelled as
'cheap' or 'expensive', depending on if their monthly maintenance cost is
more than $100? Return the name and monthly maintenance of the facilities
in question. */

In [10]:
sql_query = """SELECT facid, name, monthlymaintenance,
                CASE
                    WHEN monthlymaintenance > 100 THEN 'Expensive'
                    ELSE 'Cheap'
                END AS "Expensive or Cheap"
                FROM facilities"""
df = pd.read_sql_query(sql_query,con=engine)
df.head(20)

   facid             name  monthlymaintenance Expensive or Cheap
0      0   Tennis Court 1                 200          Expensive
1      1   Tennis Court 2                 200          Expensive
2      2  Badminton Court                  50              Cheap
3      3     Table Tennis                  10              Cheap
4      4   Massage Room 1                3000          Expensive
5      5   Massage Room 2                3000          Expensive
6      6     Squash Court                  80              Cheap
7      7    Snooker Table                  15              Cheap
8      8       Pool Table                  15              Cheap

/* Q6: You'd like to get the first and last name of the last member(s)
who signed up. Do not use the LIMIT clause for your solution. */

In [11]:
sql_query = """SELECT firstname, surname FROM members m1 WHERE m1.joindate = (SELECT MAX(m2.joindate)
                    FROM members m2)"""

df = pd.read_sql_query(sql_query,con=engine)
df.head()

  firstname surname
0    Darren   Smith

/* Q7: How can you produce a list of all members who have used a tennis court?
Include in your output the name of the court, and the name of the member
formatted as a single column. Ensure no duplicate data, and order by
the member name. */

In [12]:
# I assume a Guest is not a member
sql_query = """
SELECT DISTINCT t.name AS "Facility", CONCAT(t.surname, ', ', t.firstname) AS "Member Name" FROM 
(SELECT b.facid, b.memid, m.firstname, m.surname, f.name
                FROM bookings b
                INNER JOIN 
                    members m
                    ON m.memid = b.memid
                INNER JOIN
                    facilities f
                    ON f.facid = b.facid 
                WHERE b.facid IN (SELECT facid FROM facilities WHERE name ILIKE 'Tennis%%')) t
                WHERE t.memid != 0
                ORDER by "Member Name" """
df = pd.read_sql_query(sql_query,con=engine)
df

          Facility         Member Name
0   Tennis Court 1     Bader, Florence
1   Tennis Court 2     Bader, Florence
2   Tennis Court 1         Baker, Anne
3   Tennis Court 2         Baker, Anne
4   Tennis Court 1      Baker, Timothy
5   Tennis Court 2      Baker, Timothy
6   Tennis Court 1         Boothe, Tim
7   Tennis Court 2         Boothe, Tim
8   Tennis Court 1     Butters, Gerald
9   Tennis Court 2     Butters, Gerald
10  Tennis Court 1        Coplin, Joan
11  Tennis Court 1      Crumpet, Erica
12  Tennis Court 1         Dare, Nancy
13  Tennis Court 2         Dare, Nancy
14  Tennis Court 1      Farrell, David
15  Tennis Court 2      Farrell, David
16  Tennis Court 1     Farrell, Jemima
17  Tennis Court 2     Farrell, Jemima
18  Tennis Court 1    Genting, Matthew
19  Tennis Court 1          Hunt, John
20  Tennis Court 2          Hunt, John
21  Tennis Court 1        Jones, David
22  Tennis Court 2        Jones, David
23  Tennis Court 1      Jones, Douglas
24  Tennis Court 1    Joplette, Janice
25  Tennis Court 2    Joplette, Janice
26  Tennis Court 1       Owen, Charles
27  Tennis Court 2       Owen, Charles
28  Tennis Court 1       Pinker, David
29  Tennis Court 2  Purview, Millicent
30  Tennis Court 1         Rownam, Tim
31  Tennis Court 2         Rownam, Tim
32  Tennis Court 2   Rumney, Henrietta
33  Tennis Court 1   Sarwin, Ramnaresh
34  Tennis Court 2   Sarwin, Ramnaresh
35  Tennis Court 2       Smith, Darren
36  Tennis Court 1         Smith, Jack
37  Tennis Court 2         Smith, Jack
38  Tennis Court 1        Smith, Tracy
39  Tennis Court 2        Smith, Tracy
40  Tennis Court 1    Stibbons, Ponder
41  Tennis Court 2    Stibbons, Ponder
42  Tennis Court 1       Tracy, Burton
43  Tennis Court 2       Tracy, Burton

/* Q8: How can you produce a list of bookings on the day of 2012-09-14 which
will cost the member (or guest) more than $30? Remember that guests have
different costs to members (the listed costs are per half-hour 'slot'), and
the guest user's ID is always 0. Include in your output the name of the
facility, the name of the member formatted as a single column, and the cost.
Order by descending cost, and do not use any subqueries. */

In [13]:
sql_query = """SELECT f.name,
                      CASE
                          WHEN b.memid != 0 THEN CONCAT(m.surname, ', ',m.firstname)
                          ELSE LOWER(m.surname) END AS name,
                      CASE
                          WHEN b.memid = 0 THEN (b.slots * f.guestcost) 
                          ELSE (b.slots * f.membercost) END AS "Total Cost"
                FROM bookings b
                INNER JOIN
                    facilities f
                    ON b.facid = f.facid
                INNER JOIN
                    members m
                    ON b.memid = m.memid
                 WHERE
                         b.starttime ILIKE '2012-09-14%%' -- date condition applies to all
                     AND (
                             ((b.memid = 0) AND (b.slots * f.guestcost > 30)) -- guest and > 30
                            OR
                             ((b.memid != 0) AND (b.slots * f.membercost > 30)) -- member and > 30
                         )
                     ORDER BY "Total Cost" DESC      """
df = pd.read_sql_query(sql_query,con=engine)
df

              name             name  Total Cost
0   Massage Room 2            guest       320.0
1   Massage Room 1            guest       160.0
2   Massage Room 1            guest       160.0
3   Massage Room 1            guest       160.0
4   Tennis Court 2            guest       150.0
5   Tennis Court 1            guest        75.0
6   Tennis Court 1            guest        75.0
7   Tennis Court 2            guest        75.0
8     Squash Court            guest        70.0
9   Massage Room 1  Farrell, Jemima        39.6
10    Squash Court            guest        35.0
11    Squash Court            guest        35.0

/* Q9: This time, produce the same result as in Q8, but using a subquery. */

In [14]:
sql_query = """
                SELECT 
                f.name,
                CASE
                    WHEN sub.memid != 0 THEN CONCAT(m.surname, ', ',m.firstname)
                    ELSE LOWER(m.surname) END AS name,
                CASE
                    WHEN sub.memid = 0 THEN (sub.slots * f.guestcost) 
                    ELSE (sub.slots * f.membercost) END AS "Total Cost"                
                FROM
                
                -- Use a Subquery to simplify the final set of WHERE condition --
                (
                SELECT * FROM bookings b
                    WHERE starttime ILIKE '2012-09-14%%'
                ) sub
                -- End of Subquery --
                
                INNER JOIN facilities f
                    ON sub.facid = f.facid
                INNER JOIN members m
                    ON sub.memid = m.memid
                WHERE
                    ((sub.memid = 0) AND (sub.slots * f.guestcost > 30)) -- guest and > 30
                    OR
                    ((sub.memid != 0) AND (sub.slots * f.membercost > 30)) -- member and > 30               
                 ORDER BY "Total Cost" DESC
            """
#                     starttiem memid IN 
#                 INNER JOIN members m
#                 ON b.memid = m.memid
#                 INNER JOIN facilities f
#                 ON b.facid = f.facid
                
                
                
                
df = pd.read_sql_query(sql_query,con=engine)
df

              name             name  Total Cost
0   Massage Room 2            guest       320.0
1   Massage Room 1            guest       160.0
2   Massage Room 1            guest       160.0
3   Massage Room 1            guest       160.0
4   Tennis Court 2            guest       150.0
5   Tennis Court 1            guest        75.0
6   Tennis Court 1            guest        75.0
7   Tennis Court 2            guest        75.0
8     Squash Court            guest        70.0
9   Massage Room 1  Farrell, Jemima        39.6
10    Squash Court            guest        35.0
11    Squash Court            guest        35.0

/* Q10: Produce a list of facilities with a total revenue less than 1000.
The output of facility name and total revenue, sorted by revenue. Remember
that there's a different cost for guests and members! */

Note: I assume that `revenue` does not include the initial outlay or monthly maintenance

So, revenue is calculated from slots x cost per slot where the cost is determined by guest or member category

In [15]:
sql_query = """

            SELECT sub2.name, SUM(sub2.revenue) AS "Total Revenue"
            
            FROM

                ( SELECT sub.name, sub.membercost,
                        sub.guestcost, sub.member_guest, SUM(sub.slots) AS mg_slots,
                        CASE
                            WHEN member_guest = 'm' THEN sub.membercost * SUM(sub.slots)
                            WHEN member_guest = 'g' THEN sub.guestcost * SUM(sub.slots)
                        END AS revenue
                    FROM
                        (SELECT b.facid, b.memid, b.slots, f.membercost, f.guestcost, f.name,
                        CASE
                            WHEN memid = 0 THEN 'g'
                            ELSE 'm'
                        END AS Member_Guest
                        FROM bookings b
                            INNER JOIN facilities f
                            ON b.facid = f.facid 
                        ) sub
            
                GROUP BY
                sub.name, sub.member_guest, sub.membercost, sub.guestcost
                ORDER BY sub.name ) sub2
            
            GROUP BY sub2.name
            HAVING SUM(sub2.revenue)  < 1000
            ORDER BY "Total Revenue" DESC
                
                
                
                
            """
df = pd.read_sql_query(sql_query,con=engine)
df.head()

            name  Total Revenue
0     Pool Table          270.0
1  Snooker Table          240.0
2   Table Tennis          180.0